In [1]:
#Real dataset : - 
#automobile_data.csv
#symbolic normalised losses  make   fuel-type  body-style city-mpg  highway-mpg
#horse-power  engine-type   engine-location  price
#csv means comma separated values

In [2]:
import os
os.getcwd()

'C:\\Users\\Admin\\Desktop\\Anup\\Data analitycs'

In [3]:
#work on real data file
#to read csv file : use inbuilt function read_csv("filename.csv")
#which is inbuilt method of pandas
import pandas as pd 
import numpy as np

In [4]:
#to load csv file
car=pd.read_csv('automobile_data.csv') #here car is user defined dataframe

In [5]:
#to show first 5 record
car.head()

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,13495
1,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,16500
2,1,?,alfa-romero,gas,hatchback,rwd,front,65.5,52.4,ohcv,152,154,19,26,16500
3,2,164,audi,gas,sedan,fwd,front,66.2,54.3,ohc,109,102,24,30,13950
4,2,164,audi,gas,sedan,4wd,front,66.4,54.3,ohc,136,115,18,22,17450

In [6]:
#to show num of row and col, use shape method
car.shape

(205, 15)

In [7]:
#finding max price of car, use inbuilt function max() i.e from numpy lib
car['price'].max()

45400

In [8]:
#finding record No. of max priced car, use inbuilt method idxmax()
#idx means record np
car['price'].idxmax()
#for minium price use idxmin()

74

In [9]:
#to show details of 74 no record
car.iloc[74]

symboling                        1
normalized-losses                ?
make                 mercedes-benz
fuel-type                      gas
body-style                 hardtop
drive-wheels                   rwd
engine-location              front
width                           72
height                        55.4
engine-type                   ohcv
engine-size                    304
horsepower                     184
city-mpg                        14
highway-mpg                     16
price                        45400
Name: 74, dtype: object

In [10]:
car.columns

Index(['symboling', 'normalized-losses', 'make', 'fuel-type', 'body-style',
       'drive-wheels', 'engine-location', 'width', 'height', 'engine-type',
       'engine-size', 'horsepower', 'city-mpg', 'highway-mpg', 'price'],
      dtype='object')

In [11]:
#to show fule type of car in given dataset
car['fuel-type'].unique()

array(['gas', 'diesel'], dtype=object)

In [12]:
#to show how many gas cars and how many diesel cars in given datframe, use value_counts()
car['fuel-type'].value_counts()

gas       185
diesel     20
Name: fuel-type, dtype: int64

In [13]:
#to sum price on bases of fule type, use inbuilt method groupby()
car.groupby('fuel-type')['price'].sum()

fuel-type
diesel     316763
gas       2394870
Name: price, dtype: int64

In [14]:
#to find avg price
car.groupby('fuel-type')['price'].mean()

fuel-type
diesel    15838.150000
gas       12945.243243
Name: price, dtype: float64

In [15]:
#type of body style of car
car['body-style'].unique()

array(['convertible', 'hatchback', 'sedan', 'wagon', 'hardtop'],
      dtype=object)

In [16]:
#how many no. of care according to body-style
car['body-style'].value_counts()

sedan          96
hatchback      70
wagon          25
hardtop         8
convertible     6
Name: body-style, dtype: int64

In [17]:
#to see all info of hardtop car
car[car['body-style']=='hardtop']
#condition ; car[car['body-style']=='hardtop']

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
69,0,93,mercedes-benz,diesel,hardtop,rwd,front,70.3,54.9,ohc,183,123,22,25,28176
74,1,?,mercedes-benz,gas,hardtop,rwd,front,72.0,55.4,ohcv,304,184,14,16,45400
98,2,168,nissan,gas,hardtop,fwd,front,63.8,53.3,ohc,97,69,31,37,8249
126,3,?,porsche,gas,hardtop,rwd,rear,65.0,51.6,ohcf,194,207,17,25,32528
127,3,?,porsche,gas,hardtop,rwd,rear,65.0,51.6,ohcf,194,207,17,25,34028
167,2,134,toyota,gas,hardtop,rwd,front,65.6,52.0,ohc,146,116,24,30,8449
168,2,134,toyota,gas,hardtop,rwd,front,65.6,52.0,ohc,146,116,24,30,9639
170,2,134,toyota,gas,hardtop,rwd,front,65.6,52.0,ohc,146,116,24,30,11199

In [18]:
#to show sum of gas and diesel care taking primary as fuel--type
car.groupby(['body-style','fuel-type'])['price'].sum()
#condition: groupby(['body-style','fuel-type'])['price'].sum()

body-style   fuel-type
convertible  gas           131343
hardtop      diesel         28176
             gas           149492
hatchback    diesel          7788
             gas           693318
sedan        diesel        221616
             gas          1170601
wagon        diesel         59183
             gas           250116
Name: price, dtype: int64

In [19]:
car.groupby(['make','fuel-type'])['price'].sum()

make           fuel-type
alfa-romero    gas           46495
audi           gas          119155
bmw            gas          208950
chevrolet      gas           18021
dodge          gas           70879
honda          gas          106401
isuzu          gas           50833
jaguar         gas          103800
mazda          diesel        29139
               gas          151960
mercedes-benz  diesel       113576
               gas          155600
mercury        gas           16503
mitsubishi     gas          120117
nissan         diesel         7099
               gas          180383
peugot         diesel        78985
               gas           91395
plymouth       gas           55744
porsche        gas          137602
renault        gas           19190
saab           gas           91340
subaru         gas          102495
toyota         diesel        26384
               gas          289962
volkswagen     diesel        39110
               gas           81820
volvo          diesel        22470
               gas          176225
Name: price, dtype: int64

In [20]:
car.groupby(['make','body-style'])['price'].sum()

make           body-style
alfa-romero    convertible     29995
               hatchback       16500
audi           hatchback       12000
               sedan           88235
               wagon           18920
bmw            sedan          208950
chevrolet      hatchback       11446
               sedan            6575
dodge          hatchback       39099
               sedan           22859
               wagon            8921
honda          hatchback       49381
               sedan           49725
               wagon            7295
isuzu          hatchback       11048
               sedan           39785
jaguar         sedan          103800
mazda          hatchback      100850
               sedan           80249
mercedes-benz  convertible     35056
               hardtop         73576
               sedan          132296
               wagon           28248
mercury        hatchback       16503
mitsubishi     hatchback       86381
               sedan           33736
nissan         hardtop          8249
               hatchback       72045
               sedan           77441
               wagon           29747
peugot         sedan          110310
               wagon           60070
plymouth       hatchback       32522
               sedan           14301
               wagon            8921
porsche        convertible     37028
               hardtop         66556
               hatchback       34018
renault        hatchback        9895
               wagon            9295
saab           hatchback       45040
               sedan           46300
subaru         hatchback       19774
               sedan           45353
               wagon           37368
toyota         convertible     17669
               hardtop         29287
               hatchback      134624
               sedan           95422
               wagon           39344
volkswagen     convertible     11595
               hatchback        9980
               sedan           87065
               wagon           12290
volvo          sedan          149815
               wagon           48880
Name: price, dtype: int64

In [21]:
#merge()
#types 1. inner() 2. outer()
#create a DataFarme with the help of dictionary
d1={'name':['anu','deepak','suresh','asha'],'python':[62,76,89,90]}
print(d1)
print(type(d1))

{'name': ['anu', 'deepak', 'suresh', 'asha'], 'python': [62, 76, 89, 90]}
<class 'dict'>

In [22]:
#creating dataframe
df1=pd.DataFrame(d1)
print(df1)

     name  python
0     anu      62
1  deepak      76
2  suresh      89
3    asha      90

In [23]:
#create a another DataFarme with the help of dictionary
d2={'name':['anu','suresh','asha','priya','seema'],'ML':[50,60,54,69,90]}
print(d2)
print(type(d2))

{'name': ['anu', 'suresh', 'asha', 'priya', 'seema'], 'ML': [50, 60, 54, 69, 90]}
<class 'dict'>

In [24]:
#creating dataframe
df2=pd.DataFrame(d2)
print(df2)

     name  ML
0     anu  50
1  suresh  60
2    asha  54
3   priya  69
4   seema  90

In [25]:
#merge both dataframes df1 and df2 on common column name and hold in new
#dataframe new_df
#1. inner join means to join only common data means intersection
new_df=pd.merge(df1,df2,on="name")#bydefault inner join or equal join
#syntax of merge
#new dataframe=pd.merge(dataframe1,dataframe2,...,on="common column of all df")
print(new_df)

     name  python  ML
0     anu      62  50
1  suresh      89  60
2    asha      90  54

In [26]:
#outer join
new_df=pd.merge(df1,df2,on="name",how='outer')#bydefault ho="inner"
#similar to union
print(new_df)

     name  python    ML
0     anu    62.0  50.0
1  deepak    76.0   NaN
2  suresh    89.0  60.0
3    asha    90.0  54.0
4   priya     NaN  69.0
5   seema     NaN  90.0

# Append

In [28]:

#creating DataFrame with Dict
d1={'name':['anu','deepa','anil'],'python':[45,67,89]}
df1=pd.DataFrame(d1)
print(df1)

    name  python
0    anu      45
1  deepa      67
2   anil      89

In [29]:
d2={'name':['shushak','suresh','pinki','mohan','ram'],'python':[90,67,58,79,45]}
df2=pd.DataFrame(d2)
print(df2)

      name  python
0  shushak      90
1   suresh      67
2    pinki      58
3    mohan      79
4      ram      45

In [35]:
#using Append function
df3=df1.append(df2)
df3

      name  python
0      anu      45
1    deepa      67
2     anil      89
0  shushak      90
1   suresh      67
2    pinki      58
3    mohan      79
4      ram      45

In [36]:
#removing record (number/index) num
df3=df1.append(df2,ignore_index=True)
df3

      name  python
0      anu      45
1    deepa      67
2     anil      89
3  shushak      90
4   suresh      67
5    pinki      58
6    mohan      79
7      ram      45

# print data in order

In [40]:
#to find ascii value (American Standard Code For Information Interchange)
print(ord("A"))
print(ord("j"))
print(ord("D"))
print(ord("t"))

65
106
68
116

In [43]:
#sort_values() : to arrange records in ascending or descending order
#according to column
df3.sort_values('name') #sort_values(by='column name',ascending=True) 
#bydefault ascending
#to sort data in temporary

      name  python
2     anil      89
0      anu      45
1    deepa      67
6    mohan      79
5    pinki      58
7      ram      45
3  shushak      90
4   suresh      67

In [44]:
#sort_values() : to arrange records in ascending or descending order
#according to column
df3.sort_values('name',ignore_index=True) #sort_values(by='column name',ascending=True) 
#bydefault ascending
#to sort data in temporary

      name  python
0     anil      89
1      anu      45
2    deepa      67
3    mohan      79
4    pinki      58
5      ram      45
6  shushak      90
7   suresh      67

# for decending order

In [45]:
#sort_values() : to arrange records in ascending or descending order
#according to column
df3.sort_values('name',ascending=False,ignore_index=True) #sort_values(by='column name',ascending=True) 
#bydefault ascending
#to sort data in temporary

      name  python
0   suresh      67
1  shushak      90
2      ram      45
3    pinki      58
4    mohan      79
5    deepa      67
6      anu      45
7     anil      89